package ru.kataproject.p_sm_airlines_1.entity;

import lombok.Getter;
import lombok.RequiredArgsConstructor;

/**
 * Enumeration of the Russian airport's codes ICAO.
 *
 * @author Pushkarev Alexandr (event2b@yandex.ru)
 * @since 03.11.2022
 */

@Getter
@RequiredArgsConstructor
public enum Code_ICAO {
    UNAA ("Абакан"),
    UHMA ("Анадырь (Угольный)"),
    URKA ("Анапа (Витязево)"),
    ULAA ("Архангельск (Талаги)"),
    URWA ("Астрахань (Нариманово)"),
    UNBB ("Барнаул"),
    UUOB ("Белгород"),
    UHBB ("Благовещенск (Игнатьево)"),
    UIBB ("Братск"),
    UUBP ("Брянск"),
    ULDW ("Варандей"),
    UHWW ("Владивосток"),
    URWW ("Волгоград (Гумрак)"),
    UUOO ("Воронеж"),
    URMG ("Грозный"),
    USSS ("Екатеринбург (Кольцово)"),
    UUBW ("Жуковский"),
    UIII ("Иркутск"),
    UWKD ("Казань"),
    UMKK ("Калининград (Храброво)"),
    UUBC ("Калуга (Грабцево)"),
    UNEE ("Кемерово"),
    URKK ("Краснодар (Пашковская)"),
    USUU ("Курган"),
    UUOK ("Курск (Восточный)"),
    UHMM ("Магадан (Сокол)"),
    USCM ("Магнитогорск"),
    URML ("Махачкала (Уйташ)"),
    URMO ("Международный аэропорт Владикавказ"),
    UNKL ("Международный аэропорт Красноярск"),
    URMM ("Минеральные Воды"),
    UUWW ("Москва (Внуково)"),
    UUDD ("Москва (Домодедово)"),
    UUMO ("Москва (Остафьево)"),
    UUEE ("Москва (Шереметьево)"),
    ULMM ("Мурманск"),
    URMN ("Нальчик"),
    USNN ("Нижневартовск"),
    UWKE ("Нижнекамск (Бегишево)"),
    UWGG ("Нижний Новгород (Стригино)"),
    UNWW ("Новокузнецк (Спиченково)"),
    UNNT ("Новосибирск (Толмачево)"),
    UNOO ("Омск (Центральный)"),
    UWOO ("Оренбург"),
    UWOR ("Орск"),
    USPP ("Пермь (Большое Савино)"),
    ULPB ("Петрозаводск (Бесовец)"),
    UHPP ("Петропавловск-Камчатский (Елизово)"),
    UHMD ("Провидения Бухта"),
    ULOO ("Псков (Кресты)"),
    URRR ("Ростов-на-Дону"),
    USDA ("Сабетта"),
    UWWW ("Самара (Курумоч)"),
    ULLI ("Санкт-Петербург (Пулково)"),
    UWPS ("Саранск"),
    UWSS ("Саратов (Центральный)"),
    UKFF ("Симферополь"),
    URSS ("Сочи"),
    URMT ("Ставрополь (Шпаковское)"),
    USRR ("Сургут"),
    UUYY ("Сыктывкар"),
    UNTT ("Томск (Богашево)"),
    USTR ("Тюмень (Рощино)"),
    UIUU ("Улан-Удэ (Мухино)"),
    UWLL ("Ульяновск (Баратаевка)"),
    UWLW ("Ульяновск (Восточный)"),
    UWUU ("Уфа"),
    UHHH ("Хабаровск (Новый)"),
    UCHH ("Ханты-Мансийск"),
    UWKS ("Чебоксары"),
    USCC ("Челябинск (Баландино)"),
    ULWC ("Череповец"),
    UIAA ("Чита (Кадала)"),
    URWI ("Элиста"),
    UHSS ("Южно-Сахалинск (Хомутово)"),
    UEEE ("Якутск"),
    UUDL ("Ярославль (Туношна)");

    private final String value;
    }
